# Conductor Material Get Conductor Material Ids Method

Source: https://www.revitapidocs.com/2026/df578b29-16e9-6d64-e33a-30178c75e509.htm

---

| Conductor Material Get Conductor Material Ids Method |
| --- |

Gets all the Conductor Material ids in the given document, sorted by name.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IList<ElementId> GetConductorMaterialIds(
	Document document
)
```

```
Public Shared Function GetConductorMaterialIds (
	document As Document
) As IList(Of ElementId)
```

```
public:
static IList<ElementId^>^ GetConductorMaterialIds(
	Document^ document
)
```

```
static member GetConductorMaterialIds :
        document : Document -> IList<ElementId>
```

#### Parameters

document Document
:   The document.

#### Return Value

IList ElementId
All the Conductor Material ids in this document. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |

See Also

#### Reference

ConductorMaterial Class Autodesk.Revit.DB.Electrical Namespace